In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [1]:
%load_ext sql

In [20]:
%sql postgresql://postgres:nubank@127.0.0.1/nubank

In [99]:
unir = pd.read_sql('''SELECT account_id, amount,
                            DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
                            FROM transfer_ins_table
                            WHERE (status = 'completed')  AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)

                            UNION ALL

                            SELECT account_id, -amount,
                            DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
                            FROM transfer_outs_table
                            WHERE (status = 'completed')  AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)
 
                            UNION ALL 

                            SELECT account_id, CASE in_or_out WHEN 'pix_out' then -pix_amount ELSE pix_amount END,
                            DATE_PART('month', to_timestamp(CAST(pix_completed_at as numeric)/1000)) MES
                            FROM pix_movements_table as p
                            WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(pix_completed_at as numeric)/1000))  = 2020)
                            ORDER BY account_id
                            
                            ''', engine)

In [100]:
unir.head()

         account_id   amount   mes
0  2569200459575096   979.35   4.0
1  2569200459575096  1559.58  12.0
2  2569200459575096   766.56   1.0
3  2569200459575096   253.42  11.0
4  2569200459575096   138.09   6.0

In [93]:
tmp_df = "./tables/tables/balance_new.csv"
unir.to_csv(tmp_df,index=False)

In [3]:
# Format
engine = create_engine('postgresql://postgres:nubank@127.0.0.1/nubank')

In [12]:
balance = pd.read_sql('''
SELECT mes, account_id,
ROUND(CAST(sum(entrada) AS NUMERIC),2) AS entradas_total,
ROUND(CAST(SUM(saida) AS NUMERIC),2) as saidas_total,
ROUND(CAST((sum(entrada) - SUM(saida))AS NUMERIC),2) as balanco
FROM (  SELECT account_id, 
        CASE in_or_out WHEN 'pix_out' then pix_amount ELSE 0 END as SAIDA, 
        CASE in_or_out WHEN  'pix_in' then pix_amount ELSE 0 END as ENTRADA,
        'PIX' AS tipo,
        DATE_PART('month', to_timestamp(CAST(pix_completed_at as numeric)/1000)) MES
        FROM pix_movements_table
        WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(pix_completed_at as numeric)/1000))  = 2020)

        UNION ALL

        SELECT account_id, 0 AS SAIDA, 
        amount as ENTRADA,
        'ENTRADA' AS tipo,
        DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
        FROM transfer_ins_table
        WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)

        UNION ALL

        SELECT account_id,
        amount as SAIDA,
        0 AS ENTRADA,
        'SAIDA' AS tipo,
        DATE_PART('month', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) MES
        FROM transfer_outs_table
        WHERE (status = 'completed') AND (DATE_PART('year', to_timestamp(CAST(transaction_completed_at as numeric)/1000)) = 2020)) as transac
GROUP BY mes, account_id
ORDER BY account_id, mes
''', engine)

In [13]:
balance.head(13)

     mes        account_id  entradas_total  saidas_total  balanco
0    1.0  2569200459575096         6622.15       1826.30  4795.85
1    2.0  2569200459575096         2510.59       4934.91 -2424.32
2    3.0  2569200459575096         2221.55       3205.17  -983.62
3    4.0  2569200459575096         4492.74        540.40  3952.34
4    5.0  2569200459575096         1825.52       2429.55  -604.03
5    6.0  2569200459575096         2322.68       3059.74  -737.06
6    7.0  2569200459575096         3003.19       8062.59 -5059.40
7    8.0  2569200459575096           80.60       2333.27 -2252.67
8    9.0  2569200459575096         2401.67       3796.14 -1394.47
9   10.0  2569200459575096         1542.31        457.52  1084.79
10  11.0  2569200459575096          253.42       5605.24 -5351.82
11  12.0  2569200459575096         7881.35       3179.07  4702.28
12   1.0  2572645138169593         3314.38       1467.31  1847.07

In [15]:
tmp_df = "./tables/tables/balance.csv"
balance.to_csv(tmp_df,index=False)